---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular.NameKey
source: html/c5556cc7-6dad-ed03-0ca4-82e4d5720d56.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular.NameKey Property

Name Key

## Syntax (C#)
```csharp
public string NameKey { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null